socialNetwork/wrk2/digital-ocean1/COMMAND_17/50
Running 1m test @ http://143.110.248.178:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 2985.859ms, rate sampling interval: 11837ms
  Thread calibration: mean lat.: 2972.369ms, rate sampling interval: 11845ms
  Thread calibration: mean lat.: 2946.454ms, rate sampling interval: 11796ms
  Thread calibration: mean lat.: 2967.526ms, rate sampling interval: 11722ms
  Thread calibration: mean lat.: 2898.699ms, rate sampling interval: 11583ms
  Thread calibration: mean lat.: 2940.386ms, rate sampling interval: 11657ms
  Thread calibration: mean lat.: 2979.556ms, rate sampling interval: 11902ms
  Thread calibration: mean lat.: 2998.959ms, rate sampling interval: 11837ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.28s     7.33s   31.08s    54.90%
    Req/Sec    22.59      1.25    24.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.53s 
 75.000%   27.36s 
 90.000%   29.18s 
 99.000%   31.08s 
 99.900%   32.01s 
 99.990%   32.44s 
 99.999%   32.54s 
100.000%   32.54s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6488.063     0.000000            1         1.00
    9469.951     0.100000          918         1.11
   12255.231     0.200000         1836         1.25
   15532.031     0.300000         2755         1.43
   18677.759     0.400000         3673         1.67
   20529.151     0.500000         4590         2.00
   21659.647     0.550000         5050         2.22
   23396.351     0.600000         5508         2.50
   25657.343     0.650000         5970         2.86
   26705.919     0.700000         6431         3.33
   27361.279     0.750000         6884         4.00
   27672.575     0.775000         7117         4.44
   27983.871     0.800000         7352         5.00
   28278.783     0.825000         7578         5.71
   28573.695     0.850000         7809         6.67
   28868.607     0.875000         8034         8.00
   29032.447     0.887500         8159         8.89
   29179.903     0.900000         8262        10.00
   29343.743     0.912500         8380        11.43
   29523.967     0.925000         8498        13.33
   29704.191     0.937500         8612        16.00
   29802.495     0.943750         8673        17.78
   29884.415     0.950000         8721        20.00
   29999.103     0.956250         8783        22.86
   30113.791     0.962500         8837        26.67
   30261.247     0.968750         8897        32.00
   30326.783     0.971875         8920        35.56
   30441.471     0.975000         8951        40.00
   30539.775     0.978125         8979        45.71
   30654.463     0.981250         9009        53.33
   30769.151     0.984375         9035        64.00
   30851.071     0.985938         9050        71.11
   30932.991     0.987500         9065        80.00
   31014.911     0.989062         9078        91.43
   31113.215     0.990625         9092       106.67
   31211.519     0.992188         9109       128.00
   31277.055     0.992969         9116       142.22
   31326.207     0.993750         9122       160.00
   31375.359     0.994531         9128       182.86
   31473.663     0.995313         9135       213.33
   31588.351     0.996094         9145       256.00
   31621.119     0.996484         9146       284.44
   31719.423     0.996875         9151       320.00
   31768.575     0.997266         9154       365.71
   31834.111     0.997656         9157       426.67
   31899.647     0.998047         9161       512.00
   31916.031     0.998242         9163       568.89
   31932.415     0.998437         9164       640.00
   31981.567     0.998633         9166       731.43
   31997.951     0.998828         9168       853.33
   32079.871     0.999023         9170      1024.00
   32079.871     0.999121         9170      1137.78
   32096.255     0.999219         9171      1280.00
   32161.791     0.999316         9172      1462.86
   32194.559     0.999414         9173      1706.67
   32210.943     0.999512         9174      2048.00
   32210.943     0.999561         9174      2275.56
   32276.479     0.999609         9175      2560.00
   32276.479     0.999658         9175      2925.71
   32358.399     0.999707         9176      3413.33
   32358.399     0.999756         9176      4096.00
   32358.399     0.999780         9176      4551.11
   32440.319     0.999805         9177      5120.00
   32440.319     0.999829         9177      5851.43
   32440.319     0.999854         9177      6826.67
   32440.319     0.999878         9177      8192.00
   32440.319     0.999890         9177      9102.22
   32538.623     0.999902         9178     10240.00
   32538.623     1.000000         9178          inf
#[Mean    =    20280.720, StdDeviation   =     7327.723]
#[Max     =    32522.240, Total count    =         9178]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10866 requests in 1.00m, 2.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 171
Requests/sec:    181.07
Transfer/sec:     38.02KB